In [1]:
# Cria um dicion√°rio
dados = {'Estado': ['Santa Catarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais'], 
         'Ano': [2004, 2005, 2006, 2007, 2008], 
         'Taxa Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [2]:
from pandas import DataFrame

In [3]:
df = DataFrame(dados)

In [4]:
df.head()

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2       Tocantins  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
DataFrame(dados, columns=['Estado', 'Taxa Desemprego', 'Ano'])

           Estado  Taxa Desemprego   Ano
0  Santa Catarina              1.5  2004
1  Rio de Janeiro              1.7  2005
2       Tocantins              1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [7]:
df2 = DataFrame(dados,
                columns=['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'],
                index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [8]:
df2

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3       Tocantins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [9]:
df2.columns

Index(['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'], dtype='object')

In [10]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocantins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [11]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento     object
Ano                   int64
dtype: object

In [12]:
df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3         Tocantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [13]:
df2[['Taxa Desemprego', 'Ano']]

         Taxa Desemprego   Ano
estado1              1.5  2004
estado2              1.7  2005
estado3              1.6  2006
estado4              2.4  2007
estado5              2.7  2008

In [14]:
df2.index

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [15]:
df2.filter(items = ['estado3'], axis=0)

            Estado  Taxa Desemprego Taxa Crescimento   Ano
estado3  Tocantins              1.6              NaN  2006

In [16]:
df2.head()

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3       Tocantins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [17]:
df2.describe() #resumo estat√≠stico, s√≥ retorna as colunas num√©ricas

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [18]:
df2.isna()

         Estado  Taxa Desemprego  Taxa Crescimento    Ano
estado1   False            False              True  False
estado2   False            False              True  False
estado3   False            False              True  False
estado4   False            False              True  False
estado5   False            False              True  False

In [19]:
df2['Taxa Crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa Crescimento, dtype: bool

In [29]:
import numpy as np
import pandas as pd

In [21]:
df2['Taxa Crescimento'] = np.arange(5.)

In [22]:
df2

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007
estado5    Minas Gerais              2.7               4.0  2008

In [23]:
df2['Taxa Crescimento'].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa Crescimento, dtype: bool

In [24]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento    float64
Ano                   int64
dtype: object

In [25]:
df2.describe

<bound method NDFrame.describe of                  Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007
estado5    Minas Gerais              2.7               4.0  2008>

In [26]:
df2['estado2':'estado4']

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007

In [27]:
df2[df2['Taxa Desemprego'] < 2]

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006

In [30]:
df = pd.read_csv('dataset.csv')

In [33]:
df.head()

        ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
0  CA-2016-152156  2016-11-08  ...    261.9600        NaN
1  CA-2016-152156  2016-11-08  ...    731.9400        NaN
2  CA-2016-138688  2016-06-12  ...     14.6200        2.0
3  US-2015-108966  2015-10-11  ...    957.5775        5.0
4  US-2015-108966  2015-10-11  ...     22.3680        2.0

[5 rows x 11 columns]

In [34]:
df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      2
dtype: int64

In [36]:
moda = df['Quantidade'].value_counts().index[0]

In [37]:
print(moda)

3.0

In [38]:
df['Quantidade'].fillna(value = moda, inplace=True) 
#preenche os valores ausentes com a moda
#o inplace altera diretamente no dataset original

In [39]:
df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      0
dtype: int64

In [40]:
df.Valor_Venda.describe()

count     9994.000000
mean       229.858001
std        623.245101
min          0.444000
25%         17.280000
50%         54.490000
75%        209.940000
max      22638.480000
Name: Valor_Venda, dtype: float64

In [41]:
df2 = df.query('229 < Valor_Venda < 10000')

In [42]:
df2.Valor_Venda.describe()

count    2357.000000
mean      766.679142
std       856.315136
min       229.544000
25%       323.100000
50%       490.320000
75%       859.200000
max      9892.740000
Name: Valor_Venda, dtype: float64

In [43]:
df3 = df2.query('Valor_Venda > 766')

In [44]:
df3.head()

         ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
3   US-2015-108966  2015-10-11  ...    957.5775        5.0
7   CA-2014-115812  2014-06-09  ...    907.1520        6.0
10  CA-2014-115812  2014-06-09  ...   1706.1840        9.0
11  CA-2014-115812  2014-06-09  ...    911.4240        4.0
24  CA-2015-106320  2015-09-25  ...   1044.6300        3.0

[5 rows x 11 columns]

In [45]:
df.shape

(9994, 11)

In [46]:
df[df['Quantidade'].isin([5, 7, 9, 11])]

           ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
3     US-2015-108966  2015-10-11  ...    957.5775        5.0
5     CA-2014-115812  2014-06-09  ...     48.8600        7.0
9     CA-2014-115812  2014-06-09  ...    114.9000        5.0
10    CA-2014-115812  2014-06-09  ...   1706.1840        9.0
14    US-2015-118983  2015-11-22  ...     68.8100        5.0
...              ...         ...  ...         ...        ...
9974  US-2016-103674  2016-12-06  ...     18.6900        7.0
9977  US-2016-103674  2016-12-06  ...     13.8600        7.0
9981  CA-2017-163566  2017-08-03  ...     16.5200        5.0
9982  US-2016-157728  2016-09-22  ...     35.5600        7.0
9988  CA-2017-163629  2017-11-17  ...    206.1000        5.0

[2128 rows x 11 columns]

In [47]:
df[df['Quantidade'].isin([5, 7, 9, 11])].shape

(2128, 11)

In [48]:
df[df['Quantidade'].isin([5, 7, 9, 11])][:10]

         ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
3   US-2015-108966  2015-10-11  ...    957.5775        5.0
5   CA-2014-115812  2014-06-09  ...     48.8600        7.0
9   CA-2014-115812  2014-06-09  ...    114.9000        5.0
10  CA-2014-115812  2014-06-09  ...   1706.1840        9.0
14  US-2015-118983  2015-11-22  ...     68.8100        5.0
21  CA-2016-137330  2016-12-09  ...     19.4600        7.0
22  CA-2016-137330  2016-12-09  ...     60.3400        7.0
27  US-2015-150630  2015-09-17  ...   3083.4300        7.0
35  CA-2016-117590  2016-12-08  ...   1097.5440        7.0
36  CA-2016-117590  2016-12-08  ...    190.9200        5.0

[10 rows x 11 columns]

In [49]:
df[(df.Segmento == 'Home Office') & (df.Regiao == 'South')].head()

          ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
182  CA-2014-158274  2014-11-19  ...    503.9600        4.0
183  CA-2014-158274  2014-11-19  ...    149.9500        5.0
184  CA-2014-158274  2014-11-19  ...     29.0000        2.0
231  US-2017-100930  2017-04-07  ...    233.8600        2.0
232  US-2017-100930  2017-04-07  ...    620.6145        3.0

[5 rows x 11 columns]

In [52]:
df[(df.Segmento == 'Home Office') | (df.Regiao == 'South')].tail()

           ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
9979  US-2016-103674  2016-12-06  ...     437.472       14.0
9980  US-2015-151435  2015-09-06  ...      85.980        1.0
9987  CA-2017-163629  2017-11-17  ...      79.990        1.0
9988  CA-2017-163629  2017-11-17  ...     206.100        5.0
9989  CA-2014-110422  2014-01-21  ...      25.248        3.0

[5 rows x 11 columns]

In [53]:
df[(df.Segmento != 'Home Office') & (df.Regiao != 'South')].sample(5)

           ID_Pedido Data_Pedido  ... Valor_Venda Quantidade
7862  CA-2015-142993  2015-10-12  ...      81.960        2.0
8183  CA-2017-155642  2017-05-18  ...       1.892        1.0
1535  CA-2016-112389  2016-10-29  ...      40.740        3.0
4696  US-2015-138121  2015-12-17  ...     142.360        2.0
7732  CA-2017-143294  2017-06-02  ...      10.688        2.0

[5 rows x 11 columns]

In [55]:
df[['Segmento', 'Regiao', 'Valor_Venda']].groupby(['Segmento', 'Regiao']).mean()

                     Valor_Venda
Segmento    Regiao
Consumer    Central   207.946728
            East      238.875539
            South     233.390180
            West      217.033955
Corporate   Central   234.763466
            East      228.516929
            South     238.992025
            West      235.265911
Home Office Central   208.248046
            East      253.911805
            South     272.996329
            West      239.442692

In [56]:
df[['Segmento', 'Regiao', 'Valor_Venda']].groupby(['Segmento', 'Regiao']).agg(['mean','std', 'count'])

                    Valor_Venda
                           mean          std count
Segmento    Regiao
Consumer    Central  207.946728   587.906523  1212
            East     238.875539   633.371169  1469
            South    233.390180   559.346824   838
            West     217.033955   551.997547  1672
Corporate   Central  234.763466   818.947521   673
            East     228.516929   530.001654   877
            South    238.992025   586.176947   510
            West     235.265911   471.288764   960
Home Office Central  208.248046   371.009180   438
            East     253.911805   722.777318   502
            South    272.996329  1404.798466   272
            West     239.442692   529.242737   571